In [4]:
import pandas as pd
import numpy as np

In [2]:
pd.DataFrame([{'a':10, 'b':10}, {'a':20}])

    a     b
0  10  10.0
1  20   NaN

In [13]:
numbers = [_*10 for _ in range (10)]
arr = np.array(numbers)
arr = arr.reshape([2,5])
arr

array([[ 0, 10, 20, 30, 40],
       [50, 60, 70, 80, 90]])

In [16]:
df= pd.DataFrame(arr, index=['r1', 'r2'], columns=['c1','c2','c3','c4','c5'])

In [17]:
df.head()

    c1  c2  c3  c4  c5
r1   0  10  20  30  40
r2  50  60  70  80  90

In [18]:
df.tail()

    c1  c2  c3  c4  c5
r1   0  10  20  30  40
r2  50  60  70  80  90

In [19]:
df.head(1)

    c1  c2  c3  c4  c5
r1   0  10  20  30  40

In [20]:
df.tail(1)

    c1  c2  c3  c4  c5
r2  50  60  70  80  90

In [21]:
df.columns

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [23]:
df.index

Index(['r1', 'r2'], dtype='object')

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, r1 to r2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      2 non-null      int32
 1   c2      2 non-null      int32
 2   c3      2 non-null      int32
 3   c4      2 non-null      int32
 4   c5      2 non-null      int32
dtypes: int32(5)
memory usage: 56.0+ bytes

In [28]:
df.describe()

              c1         c2         c3         c4         c5
count   2.000000   2.000000   2.000000   2.000000   2.000000
mean   25.000000  35.000000  45.000000  55.000000  65.000000
std    35.355339  35.355339  35.355339  35.355339  35.355339
min     0.000000  10.000000  20.000000  30.000000  40.000000
25%    12.500000  22.500000  32.500000  42.500000  52.500000
50%    25.000000  35.000000  45.000000  55.000000  65.000000
75%    37.500000  47.500000  57.500000  67.500000  77.500000
max    50.000000  60.000000  70.000000  80.000000  90.000000

In [29]:
df.isna()

       c1     c2     c3     c4     c5
r1  False  False  False  False  False
r2  False  False  False  False  False

In [30]:
df.c1

r1     0
r2    50
Name: c1, dtype: int32

In [32]:
df[['c2', 'c3']]

    c2  c3
r1  10  20
r2  60  70

In [36]:
type(df['c1'])

pandas.core.series.Series

In [37]:
df[['c1']]

    c1
r1   0
r2  50

In [35]:
type(df[['c1']])

pandas.core.frame.DataFrame

In [39]:
df['c2'].isna()

r1    False
r2    False
Name: c2, dtype: bool

In [40]:
df.c2

r1    10
r2    60
Name: c2, dtype: int32

In [41]:
df.c3.isna()

r1    False
r2    False
Name: c3, dtype: bool

In [42]:
df[['c2', 'c4']].isna()

       c2     c4
r1  False  False
r2  False  False

In [43]:
df['c3'].min()

20

In [44]:
df['c5'].max()

90

In [45]:
df[['c1', 'c3']].mean()

c1    25.0
c3    45.0
dtype: float64

In [46]:
df[['c2', 'c4']].isna().sum()

c2    0
c4    0
dtype: int64

In [47]:
df.sum()

c1     50
c2     70
c3     90
c4    110
c5    130
dtype: int64

In [48]:
df.count()

c1    2
c2    2
c3    2
c4    2
c5    2
dtype: int64

In [49]:
df.min()

c1     0
c2    10
c3    20
c4    30
c5    40
dtype: int32

In [50]:
df.iloc[0, 0]

0

In [63]:
df.iloc[:, 3]

r1    30
r2    80
Name: c4, dtype: int32

In [65]:
df.loc[:, 'c3':'c5']

    c3  c4  c5
r1  20  30  40
r2  70  80  90

In [66]:
del df['c3']
df

    c1  c2  c4  c5
r1   0  10  30  40
r2  50  60  80  90

In [67]:
df.drop('r1')

    c1  c2  c4  c5
r2  50  60  80  90

In [70]:
df.drop('c2', axis=1)

    c1  c4  c5
r1   0  30  40
r2  50  80  90

In [71]:
df

    c1  c2  c4  c5
r1   0  10  30  40
r2  50  60  80  90

In [72]:
df.drop(['c1', 'c5'], axis=1)

    c2  c4
r1  10  30
r2  60  80

In [74]:
df['c6'] = 5

In [75]:
df

    c1  c2  c4  c5  c6
r1   0  10  30  40   5
r2  50  60  80  90   5